In [ ]:
# engine = sqlalchemy.create_engine('postgresql://postgres:test1234@localhost:5432/sql-shack-demo')
# pip install psycopg2

In [ ]:
# import pandas
# import sqlalchemy
 
# # Create the engine to connect to the PostgreSQL database
# engine = sqlalchemy.create_engine('postgresql://postgres:test1234@localhost:5432/sql-shack-demo')
 
# # Read data from CSV and load into a dataframe object
# data = pandas.read_csv('C:/temp/pandas-db-sqlshack-demo/pandas-env/superstore.csv')
 
# # Write data into the table in PostgreSQL database
# data.to_sql('superstore',engine)

In [1]:
# import sqlite3
import sqlite3 as sqlite

# import pandas
import pandas as pd

# import sqlalchemy
from sqlalchemy import create_engine

In [2]:
with sqlite.connect('population.db') as con:
    cur = con.cursor()    
    cur.execute("CREATE TABLE IF NOT EXISTS Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Germany',81197537)")
    cur.execute("INSERT INTO Population VALUES(NULL,'France', 66415161)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")

In [3]:
connection = create_engine('sqlite:///population.db')

In [4]:
# create SQL query
sql = 'SELECT * FROM Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql_query(sql, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

In [5]:
# create SQL query
sql = 'SELECT * FROM Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql(sql, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

In [6]:
# table name
table = 'Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql(table, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864